# 7.1 데이터 합치기

## 7.1.1 데이터베이스 스타일로 데이터프레임 합치기

## 7.3.2 함수나 매핑으로 데이터 변형하기

In [8]:
import pandas as pd
data=pd.DataFrame({'food':['bac','pulled pork', 'bac', 'pas','pas', 'bac', 'pas', 'honey', 'nova'],
                  'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0          bac     4.0
1  pulled pork     3.0
2          bac    12.0
3          pas     6.0
4          pas     7.5
5          bac     8.0
6          pas     3.0
7        honey     5.0
8         nova     6.0

In [9]:
meat_to_animal ={
    'bac':'pig',
    'pulled pork':'pig',
    'pas':'cow',
    'honey':'pig',
    'nova':'salmon'
}

In [11]:
data['animal']=data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0          bac     4.0     pig
1  pulled pork     3.0     pig
2          bac    12.0     pig
3          pas     6.0     cow
4          pas     7.5     cow
5          bac     8.0     pig
6          pas     3.0     cow
7        honey     5.0     pig
8         nova     6.0  salmon

In [12]:
import pandas as pd
data=pd.DataFrame({'k1':['one']*3 + ['two']*4,
                  'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [14]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [15]:
data['v1']=range(7)
# 특정 컬럼에 기반해서 중복을 걸러내기
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [16]:
data.drop_duplicates(['k1','k2'], keep='last') # 마지막 값을 남기기

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [21]:
from pandas import Series
import numpy as np

data=Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [25]:
# 여러 개 값 한 번에 치환하기
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [26]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [29]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                 index=['Ohio','Colorado','New Tork'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New Tork    8    9     10    11

In [28]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW TORK'], dtype='object')

In [31]:
data.index=data.index.map(str.upper)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW TORK    8    9     10    11

In [32]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW TORK    8    9        10    11

In [33]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

bins =[18,25,35,60,100]

cats=pd.cut(ages, bins, right=True) # right=False로 괄호와 대괄호 위치 변경 가능
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [34]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [35]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [36]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [37]:
group_names=['Youth','YoungAdult','MiddleAge','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAge', 'MiddleAge', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAge' < 'Senior']

In [38]:
# 그룹의 개수를 넘겨주어, 데이터에서 최소 최대 기준으로 균등한 길이의 그룹 자동 계산
data=np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.74, 0.98], (0.49, 0.74], (0.49, 0.74], (0.74, 0.98], (0.49, 0.74], ..., (0.74, 0.98], (0.25, 0.49], (0.25, 0.49], (0.25, 0.49], (0.74, 0.98]]
Length: 20
Categories (4, interval[float64, right]): [(0.0052, 0.25] < (0.25, 0.49] < (0.49, 0.74] < (0.74, 0.98]]

In [39]:
# qcut: 표본 변위치를 기반으로 데이터를 나누는 함수
data=np.random.rand(1000)

cats=pd.qcut(data,4)
cats

[(0.514, 0.773], (0.773, 0.999], (0.239, 0.514], (0.514, 0.773], (0.773, 0.999], ..., (0.239, 0.514], (0.514, 0.773], (0.514, 0.773], (-0.000599, 0.239], (0.773, 0.999]]
Length: 1000
Categories (4, interval[float64, right]): [(-0.000599, 0.239] < (0.239, 0.514] < (0.514, 0.773] < (0.773, 0.999]]

In [40]:
pd.value_counts(cats)

(-0.000599, 0.239]    250
(0.239, 0.514]        250
(0.514, 0.773]        250
(0.773, 0.999]        250
dtype: int64

In [41]:
# 변위치 직접 지정하기(0~1)
pd.qcut(data, [0,0.1,0.5,0.9,1.])

[(0.514, 0.915], (0.915, 0.999], (0.103, 0.514], (0.514, 0.915], (0.915, 0.999], ..., (0.103, 0.514], (0.514, 0.915], (0.514, 0.915], (0.103, 0.514], (0.915, 0.999]]
Length: 1000
Categories (4, interval[float64, right]): [(-0.000599, 0.103] < (0.103, 0.514] < (0.514, 0.915] < (0.915, 0.999]]

In [42]:
ls

'CH4 Numpy기본_배열과 벡터 계산.ipynb'
'CH5 pandas 시작하기.ipynb'
'Ch7 데이터 준비하기 다듬기, 변형, 병합.ipynb'
'Ch9 데이터 수집과 그룹연산.ipynb'
 메모.ipynb
 pydata-book/

In [ ]:
hyolimpython_studypydata-bookdatasetsmovielens

In [43]:
mnames=['movie_id','title','genres']
movies=pd.read_table('pydata-book/datasets/movielens/movies.dat',
                    sep='::', header=None, names=mnames)
movies[:10]

/tmp/ipykernel_1443069/1043615325.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies=pd.read_table('pydata-book/datasets/movielens/movies.dat',

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [44]:
genre_iter=(set(x.split('|')) for x in movies.genres)
genres=sorted(set.union(*genre_iter))
genres

['Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']

In [46]:
dummies=pd.DataFrame(np.zeros((len(movies),len(genres))), columns=genres)
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [50]:
for i, gen in enumerate(movies.genres):
    dummies.loc[i, gen.split('|')]=1

In [54]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0.0,0.0,1.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),Drama,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",Drama|Thriller,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0

# 7.4 문자열 다루기

## 7.4.1 문자열 객체 메서드

In [55]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [57]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [58]:
first, second, third = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [59]:
'::'.join(pieces)

'a::b::guido'

In [60]:
'guido' in val

True

In [61]:
val.index(',')

1

In [62]:
val.find(':')

-1

## 7.4.2 정규표현식

In [64]:
# 여러 가지 공백문자가 포함된 문자열 나누기
import re

text = "foo   bar\t baz   \tqux"
re.split('\s+', text) # '\s+': 하나 이상의 공백문자

['foo', 'bar', 'baz', 'qux']

In [65]:
regex=re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [66]:
regex.findall(text)

['   ', '\t ', '   \t']

In [ ]:
regex.findall(text)